
### 1. Numpy, Pandas, Matplotlib 라이브러리의 특징에 대해 설명해주세요. 또, 파이썬 데이터 분석에서 자주 사용하는 라이브러리에 대해 자유롭게 조사하여 정리해보세요.

numpy: 다차원 배열 객체와 이를 다루는 다양한 함수를 제공하여 과학, 공학, 데이터 분석 및 머신러닝 분야에서 필수적으로 사용
pandas: 2차원 배열 형태의 dataframe 객체를 사용해 다양한 전처리 과정을 수행하는 모듈, 내부적으로 numpy를 사용함
matplotlib: 정의한 데이터를 간단하게 시각화 해주는 모듈

seaborn: pandas와 matplotlib 기반으로 더 자세한 시각화를 할 수 있는 모듈
scikit-learn: 분류(Classification), 회귀(Regression), 군집화(Clustering) 등 알고리즘을 제공하며, 모델 학습에 `fit()`(학습), `predict()`(예측) 명령어를 사용

### 2. 제1종 오류와 제2종 오류에 대해 설명해주세요.
제1종 오류($\alpha$)는 위양성오류, 제2종 오류($\beta$)는 위음성오류로 제1종 오류가 좀 더 치명적이라고 할 수 있음. (신약개발 사례) 따라서 실제 가설검정 과정에서는 우선적으로 제1종 오류의 유의수준을 고정하여 통제한 뒤 제2종 오류의 유의수준을 검정함.

### 3. p값 (p-value)는 무엇인가요?
p값은 유의수준으로, 낮을 수록 통계적으로 유의함(즉, 대립가설이 귀무가설을 기각할 가능성이 높음). 일반적으로 0.05보다 p값이 낮을 때 통계적으로 유의하다고 판단함.
> Written with [StackEdit](https://stackedit.io/).
